app/Controllers/Productos.php

    public function index()
    {
        $categoriasModel = new CategoriasModel();
        $data['categorias'] = $categoriasModel->findAll();

        $marcasModel = new MarcasModel();
        $data['marcas'] = $marcasModel->findAll();
---
SELECT *
FROM `categorias`
SELECT *
FROM `Marcas`